In [3]:
import pandas as pd
import numpy as np

dictionary = { 'name':["Nilesh","Rahul","Abhishek"],
              'age':[20, 21, 22],
              'marks':[50, 60, 70],    
             }
df = pd.DataFrame(dictionary)
print(df)

       name  age  marks
0    Nilesh   20     50
1     Rahul   21     60
2  Abhishek   22     70

In [4]:
df.to_csv("dsbda.csv")

In [5]:
df.to_csv("dsbda.csv",index=False)

In [11]:
df.head()

       name  age  marks
0    Nilesh   20     50
1     Rahul   21     60
2  Abhishek   22     70

In [12]:
df.head(2)

     name  age  marks
0  Nilesh   20     50
1   Rahul   21     60

In [13]:
df.head(1)

     name  age  marks
0  Nilesh   20     50

In [14]:
df.tail(1)

       name  age  marks
2  Abhishek   22     70

In [15]:
df.describe()

        age  marks
count   3.0    3.0
mean   21.0   60.0
std     1.0   10.0
min    20.0   50.0
25%    20.5   55.0
50%    21.0   60.0
75%    21.5   65.0
max    22.0   70.0

In [16]:
df["age"][2]

22

In [17]:
df.index=["i","ii","iii"]

In [18]:
print(df)

         name  age  marks
i      Nilesh   20     50
ii      Rahul   21     60
iii  Abhishek   22     70

In [19]:
df.name=["abc","xyz","mnp"]

In [20]:
print(df)

    name  age  marks
i    abc   20     50
ii   xyz   21     60
iii  mnp   22     70

In [21]:
series=pd.Series(np.random.rand(94))

In [22]:
print(series)

0     0.189141
1     0.451020
2     0.903163
3     0.149714
4     0.707608
        ...
89    0.618826
90    0.465050
91    0.014437
92    0.872587
93    0.450460
Length: 94, dtype: float64

In [23]:
type(series)

pandas.core.series.Series

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
type(np)

module

In [26]:
df.T

         i   ii  iii
name   abc  xyz  mnp
age     20   21   22
marks   50   60   70

In [27]:
df.sort_index(axis=0)

    name  age  marks
i    abc   20     50
ii   xyz   21     60
iii  mnp   22     70

In [28]:
df.sort_index(axis=1)

     age  marks name
i     20     50  abc
ii    21     60  xyz
iii   22     70  mnp

In [29]:
df.sort_index(axis=1,ascending=False)

    name  marks  age
i    abc     50   20
ii   xyz     60   21
iii  mnp     70   22

In [30]:
df.sort_index(axis=0,ascending=False)

    name  age  marks
iii  mnp   22     70
ii   xyz   21     60
i    abc   20     50

In [31]:
print(df)

    name  age  marks
i    abc   20     50
ii   xyz   21     60
iii  mnp   22     70

In [32]:
df.loc["i","age"]

20

In [33]:
df.size

9

In [34]:
df.shape

(3, 3)

In [35]:
df.info

<bound method DataFrame.info of     name  age  marks
i    abc   20     50
ii   xyz   21     60
iii  mnp   22     70>

In [37]:
df.drop('marks',axis=1)

    name  age
i    abc   20
ii   xyz   21
iii  mnp   22

In [38]:
df.drop('iii',axis=0)

   name  age  marks
i   abc   20     50
ii  xyz   21     60

In [39]:
print(df.isnull())

      name    age  marks
i    False  False  False
ii   False  False  False
iii  False  False  False